---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned
source: html/03e28341-f219-8090-b3cf-df6ce44b3e47.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned Property

The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.

## Syntax (C#)
```csharp
public static FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; }
```